Tekla Open API Reference for Tekla Structures 2025
ConnectionStatusEnum Enumeration
 The status type defines what the status of a connection or a detail is. In the model the color of the symbol (green, yellow, red) indicates the status.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ConnectionStatusEnum
Public Enumeration ConnectionStatusEnum
Members
Member name | Value | Description
STATUS_UNKNOWN | 0 |  The status is unknown.
STATUS_OK | 1 |  The status is ok and the symbol color is green.
STATUS_WARNING | 2 |  The status indicates a warning and the symbol color is yellow.
STATUS_ERROR | 3 |  The status indicates an error and the symbol color is red.
See Also
Reference
Tekla.Structures Namespace